import { PrototypeProject } from "./types";

export const MOCK_PROJECTS: PrototypeProject[] = [
  {
    id: "20260507",
    name: "入库页面按钮增加",
    category: "仓库入库",
    description: "待补充",
    previewUrl: null,
    subItems: [
      { id: "sub-4-1", name: "原型展示" }
    ],
    specs: [
      {
        title: "设计说明",
        content: "暂无，待后续补充。"
      }
    ]
  },
  {
    id: "20260508",
    name: "海运退运方案",
    category: "跨境物流",
    description: "针对日本邮局海运包裹派送失败退回的潜在高额追加运费痛点，设计的退运运费预扣费选项原型。",
    previewUrl: null,
    redmineUrl: "https://redmine.rakutao.vip/issues/14325",
    subItems: [
      { id: "sub-3-1", name: "运单选择主页面" }
    ],
    specs: [
      {
        title: "设计要点",
        content: (
          <span className="text-red-500 font-bold">当用户选择原路寄回时，文件导出代码为0，当用户选择放弃包裹时，代码为2</span>
        )
      },
      {
        title: "交互点击逻辑",
        content: "1. 当用户进入运单选择主页面，默认选中‘国际邮包海运’渠道。\n2. 此时，下级物流选项区域会高亮并滑入展示日本邮局海运/空运退回额外费用的提示，以及【原路寄回】与【放弃包裹】两选一选项。\n3. 该特别处理选项是由日本邮政官方规则导致，主要解决包裹退运时被强征退回运费的行业痛点。\n4. 若用户点击选择切换到其他渠道（如 EMS、顺丰大件 等），则会隐藏该选项卡。"
      },
      {
        title: "退运运费预扣与计算规则",
        content: "1. 当用户勾选【📦 【原路寄回】】并支付时：常规运费 5000円 + 箱子费 200円 + 预收退运运费 5000円 (与正常运费等额) = 实付共 10200円（支付时在右下角合计中实时体现）。\n2. 当用户勾选【🗑 【放弃包裹】】并支付时：由于不再需要退运回航路费，实付款不征收退运运费，共计 5200円（运费 5000円 + 200円箱子费）。"
      },
      {
        title: "正常派送妥退规则与退还步骤",
        content: "1. 只要包裹可以顺利配送给国内用户，确认完妥投签收后，用户即可凭收件记录联系客服申请全额原口径返还 5000 JPY 退运运费。"
      },
      {
        title: "业务背景",
        content: "由于海外退回日本运金极高（常等同于发件邮资），若用户在失联或拒付情况下强行要求退回，会导致仓库被迫代为垫付，长期累计亏损沉重。本交互通过前置双重确认把控，让用户对退运逻辑有直白地了解，不仅能极大减轻垫资风险，还免去了繁杂的工单站内信频繁沟通负担。"
      }
    ]
  }
];
